<?php

return [

    'title' => 'Ресетујте лозинку',

    'heading' => 'Заборавили сте лозинку?',

    'actions' => [

        'login' => [
            'label' => 'назад на пријаву',
        ],

    ],

    'form' => [

        'email' => [
            'label' => 'Е-пошта',
        ],

        'actions' => [

            'request' => [
                'label' => 'Пошаљи е-пошту',
            ],

        ],

    ],

    'notifications' => [

        'sent' => [
            'body' => 'Ако ваш налог не постоји, нећете примити е-пошту.',
        ],

        'throttled' => [
            'title' => 'Превише захтева',
            'body' => 'Покушајте поново за :seconds секунди.',
        ],

    ],

];
