<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Поруке за ресетовање лозинке
    |--------------------------------------------------------------------------
    */

    'reset' => 'Ваша лозинка је успешно ресетована.',
    'sent' => 'Послали смо вам линк за ресетовање лозинке на е-пошту.',
    'throttled' => 'Молимо сачекајте пре поновног покушаја.',
    'token' => 'Овај токен за ресетовање лозинке није важећи.',
    'user' => 'Не можемо да пронађемо корисника са том адресом е-поште.',

];
