<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class. Some of these rules have multiple versions such
    | as the size rules. Feel free to tweak each of these messages here.
    |
    */

    'accepted' => 'Поље мора бити прихваћено.',
    'accepted_if' => 'Поље мора бити прихваћено када је :other :value.',
    'active_url' => 'Поље није валидан URL.',
    'after' => 'Поље мора бити датум после :date.',
    'after_or_equal' => 'Поље мора бити датум после или једнак :date.',
    'alpha' => 'Поље може садржати само слова.',
    'alpha_dash' => 'Поље може садржати само слова, бројеве, цртице и доње црте.',
    'alpha_num' => 'Поље може садржати само слова и бројеве.',
    'array' => 'Поље мора бити низ.',
    'ascii' => 'Поље може садржати само једнобајтне алфанумеричке карактере и симболе.',
    'before' => 'Поље мора бити датум пре :date.',
    'before_or_equal' => 'Поље мора бити датум пре или једнак :date.',
    'between' => [
        'array' => 'Поље мора имати између :min и :max ставки.',
        'file' => 'Поље мора бити између :min и :max килобајта.',
        'numeric' => 'Поље мора бити између :min и :max.',
        'string' => 'Поље мора имати између :min и :max карактера.',
    ],
    'boolean' => 'Поље мора бити тачно или нетачно.',
    'can' => 'Поље садржи недозвољену вредност.',
    'confirmed' => 'Потврда поља се не подудара.',
    'contains' => 'Поље недостаје обавезна вредност.',
    'current_password' => 'Лозинка је неисправна.',
    'date' => 'Поље није валидан датум.',
    'date_equals' => 'Поље мора бити датум једнак :date.',
    'date_format' => 'Поље не одговара формату :format.',
    'decimal' => 'Поље мора имати :decimal децималних места.',
    'declined' => 'Поље мора бити одбијено.',
    'declined_if' => 'Поље мора бити одбијено када је :other :value.',
    'different' => 'Поље и :other морају бити различити.',
    'digits' => 'Поље мора имати :digits цифара.',
    'digits_between' => 'Поље мора имати између :min и :max цифара.',
    'dimensions' => 'Поље има неважеће димензије слике.',
    'distinct' => 'Поље има дупликат вредност.',
    'doesnt_end_with' => 'Поље не сме се завршавати са једним од следећих: :values.',
    'doesnt_start_with' => 'Поље не сме почињати са једним од следећих: :values.',
    'email' => 'Поље мора бити валидна адреса е-поште.',
    'ends_with' => 'Поље мора се завршавати са једним од следећих: :values.',
    'enum' => 'Изабрано поље је неважеће.',
    'exists' => 'Изабрано поље је неважеће.',
    'extensions' => 'Поље мора имати једну од следећих екстензија: :values.',
    'file' => 'Поље мора бити фајл.',
    'filled' => 'Поље мора имати вредност.',
    'gt' => [
        'array' => 'Поље мора имати више од :value ставки.',
        'file' => 'Поље мора бити веће од :value килобајта.',
        'numeric' => 'Поље мора бити веће од :value.',
        'string' => 'Поље мора имати више од :value карактера.',
    ],
    'gte' => [
        'array' => 'Поље мора имати :value ставки или више.',
        'file' => 'Поље мора бити веће или једнако :value килобајта.',
        'numeric' => 'Поље мора бити веће или једнако :value.',
        'string' => 'Поље мора имати :value карактера или више.',
    ],
    'hex_color' => 'Поље мора бити валидна хексадецимална боја.',
    'image' => 'Поље мора бити слика.',
    'in' => 'Изабрано поље је неважеће.',
    'in_array' => 'Поље мора постојати у :other.',
    'integer' => 'Поље мора бити цео број.',
    'ip' => 'Поље мора бити валидна IP адреса.',
    'ipv4' => 'Поље мора бити валидна IPv4 адреса.',
    'ipv6' => 'Поље мора бити валидна IPv6 адреса.',
    'json' => 'Поље мора бити валидан JSON стринг.',
    'list' => 'Поље мора бити листа.',
    'lowercase' => 'Поље мора бити малим словима.',
    'lt' => [
        'array' => 'Поље мора имати мање од :value ставки.',
        'file' => 'Поље мора бити мање од :value килобајта.',
        'numeric' => 'Поље мора бити мање од :value.',
        'string' => 'Поље мора имати мање од :value карактера.',
    ],
    'lte' => [
        'array' => 'Поље не сме имати више од :value ставки.',
        'file' => 'Поље мора бити мање или једнако :value килобајта.',
        'numeric' => 'Поље мора бити мање или једнако :value.',
        'string' => 'Поље мора имати :value карактера или мање.',
    ],
    'mac_address' => 'Поље мора бити валидна MAC адреса.',
    'max' => [
        'array' => 'Поље не сме имати више од :max ставки.',
        'file' => 'Поље не сме бити веће од :max килобајта.',
        'numeric' => 'Поље не сме бити веће од :max.',
        'string' => 'Поље не сме имати више од :max карактера.',
    ],
    'max_digits' => 'Поље не сме имати више од :max цифара.',
    'mimes' => 'Поље мора бити фајл типа: :values.',
    'mimetypes' => 'Поље мора бити фајл типа: :values.',
    'min' => [
        'array' => 'Поље мора имати најмање :min ставки.',
        'file' => 'Поље мора бити најмање :min килобајта.',
        'numeric' => 'Поље мора бити најмање :min.',
        'string' => 'Поље мора имати најмање :min карактера.',
    ],
    'min_digits' => 'Поље мора имати најмање :min цифара.',
    'missing' => 'Поље мора недостајати.',
    'missing_if' => 'Поље мора недостајати када је :other :value.',
    'missing_unless' => 'Поље мора недостајати осим ако :other није :value.',
    'missing_with' => 'Поље мора недостајати када је :values присутно.',
    'missing_with_all' => 'Поље мора недостајати када су :values присутни.',
    'multiple_of' => 'Поље мора бити вишеструко од :value.',
    'not_in' => 'Изабрано поље је неважеће.',
    'not_regex' => 'Формат поља је неважећи.',
    'numeric' => 'Поље мора бити број.',
    'password' => [
        'letters' => 'Поље мора садржати најмање једно слово.',
        'mixed' => 'Поље мора садржати најмање једно велико и једно мало слово.',
        'numbers' => 'Поље мора садржати најмање један број.',
        'symbols' => 'Поље мора садржати најмање један симбол.',
        'uncompromised' => 'Дато поље је пронађено у цурењу података. Молимо изаберите друго поље.',
    ],
    'present' => 'Поље мора бити присутно.',
    'present_if' => 'Поље мора бити присутно када је :other :value.',
    'present_unless' => 'Поље мора бити присутно осим ако :other није :value.',
    'present_with' => 'Поље мора бити присутно када је :values присутно.',
    'present_with_all' => 'Поље мора бити присутно када су :values присутни.',
    'prohibited' => 'Поље је забрањено.',
    'prohibited_if' => 'Поље је забрањено када је :other :value.',
    'prohibited_unless' => 'Поље је забрањено осим ако :other није у :values.',
    'prohibits' => 'Поље забрањује да :other буде присутно.',
    'regex' => 'Формат поља је неважећи.',
    'required' => 'Поље је обавезно.',
    'required_array_keys' => 'Поље мора садржати уносе за: :values.',
    'required_if' => 'Поље је обавезно када је :other :value.',
    'required_if_accepted' => 'Поље је обавезно када је :other прихваћено.',
    'required_if_declined' => 'Поље је обавезно када је :other одбијено.',
    'required_unless' => 'Поље је обавезно осим ако :other није у :values.',
    'required_with' => 'Поље је обавезно када је :values присутно.',
    'required_with_all' => 'Поље је обавезно када су :values присутни.',
    'required_without' => 'Поље је обавезно када :values није присутно.',
    'required_without_all' => 'Поље је обавезно када ниједан од :values није присутан.',
    'same' => 'Поље мора одговарати :other.',
    'size' => [
        'array' => 'Поље мора садржати :size ставки.',
        'file' => 'Поље мора бити :size килобајта.',
        'numeric' => 'Поље мора бити :size.',
        'string' => 'Поље мора имати :size карактера.',
    ],
    'starts_with' => 'Поље мора почињати са једним од следећих: :values.',
    'string' => 'Поље мора бити стринг.',
    'timezone' => 'Поље мора бити валидна временска зона.',
    'unique' => 'Поље је већ заузето.',
    'uploaded' => 'Поље није успело да се отпреми.',
    'uppercase' => 'Поље мора бити великим словима.',
    'url' => 'Поље мора бити валидан URL.',
    'ulid' => 'Поље мора бити валидан ULID.',
    'uuid' => 'Поље мора бити валидан UUID.',

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom validation messages for attributes using the
    | convention "rule.attribute" to name the lines. This makes it quick to
    | specify a specific custom language line for a given attribute rule.
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'custom-message',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap our attribute placeholder
    | with something more reader friendly such as "E-Mail Address" instead
    | of "email". This simply helps us make our message more expressive.
    |
    */

    'attributes' => [],

];
