<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Table Columns
    |--------------------------------------------------------------------------
    */

    'column.name' => 'Име',
    'column.guard_name' => 'Гард',
    'column.team' => 'Тим',
    'column.roles' => 'Улоге',
    'column.permissions' => 'Дозволе',
    'column.updated_at' => 'Ажурирано',

    /*
    |--------------------------------------------------------------------------
    | Form Fields
    |--------------------------------------------------------------------------
    */

    'field.name' => 'Име',
    'field.guard_name' => 'Гард',
    'field.permissions' => 'Дозволе',
    'field.team' => 'Тим',
    'field.team.placeholder' => 'Изаберите тим...',
    'field.select_all.name' => 'Означи све',
    'field.select_all.message' => 'Омогући све дозволе за ову улогу',

    /*
    |--------------------------------------------------------------------------
    | Navigation & Resource
    |--------------------------------------------------------------------------
    */

    'nav.group' => 'Улоге и дозволе',
    'nav.role.label' => 'Улоге',
    'nav.role.icon' => 'heroicon-o-shield-check',
    'resource.label.role' => 'Улога',
    'resource.label.roles' => 'Улоге',

    /*
    |--------------------------------------------------------------------------
    | Section & Tabs
    |--------------------------------------------------------------------------
    */

    'section' => 'Ентитети',
    'resources' => 'Ресурси',
    'widgets' => 'Виџети',
    'pages' => 'Странице',
    'custom' => 'Посебне дозволе',

    /*
    |--------------------------------------------------------------------------
    | Messages
    |--------------------------------------------------------------------------
    */

    'forbidden' => 'Немате дозволу за приступ',

    /*
    |--------------------------------------------------------------------------
    | Resource Permissions' Labels
    |--------------------------------------------------------------------------
    */

    'resource_permission_prefixes_labels' => [
        'view' => 'Преглед',
        'view_any' => 'Преглед свих',
        'create' => 'Креирај',
        'update' => 'Ажурирај',
        'delete' => 'Обриши',
        'delete_any' => 'Обриши све',
        'force_delete' => 'Присилно обриши',
        'force_delete_any' => 'Присилно обриши све',
        'restore' => 'Врати',
        'reorder' => 'Промени редослед',
        'restore_any' => 'Врати све',
        'replicate' => 'Дуплирај',
    ],
];
